import { useEffect, useState } from "react";
import { school1, school2 } from "../../utils/images";
import './aboutPage.scss';

export const AboutPage = () => {
  const [currentImageIndex, setCurrentImageIndex] = useState(0);
  const images = [
    school1,
    school2,
  ];

  useEffect(() => {
    const intervalId = setInterval(() => {
      setCurrentImageIndex((prevIndex) => (prevIndex + 1) % images.length);
    }, 2000);

    return () => {
      clearInterval(intervalId);
    };
  }, []);

  return (
    <div className="about">
      <div className="container">
        <div className="about__top">
          <div className="about__top-left">
            <img src={images[currentImageIndex]} alt="school" className='about__img-school' />
          </div>

          <div className="about__top-right">
            <h2 className="about__title">Історія школи</h2>

            <div className="about__top-text">
              Першу 1-класну школу в с.Довгому було відкрито в <b>1836</b> році.
              <br />- В <b>1862 р.</b> в с.Довгому була приходська школа , у якій навчалося 23 дитини ( 21 хлопець і 2 дівчини) вчитель  одержував зарплатню в розмірі 105
              фіорентів і 4 сягів дров на рік ( фіорент – австрійські гроші) (за матеріалами Львівського інституту  суспільних наук)
              <br />- В <b>1866 р.</b> в школі  с.Довге навчалось 48 хлопців  і 28 дівчат. Вчитель  - Барабаш Іван. 
              <i>  
                (Шематизм народних шкіл Львівської греко-католицької Митрополії 1866 р. ст.16.)
              </i>
            </div>
          </div>
        </div>

        <div className="about__bottom">
          <br />
          - В <b>1912</b> р. в с. Довгому була одна 2-х класова школа з двома вчителями; навчалося в ній 102 учні.
          <i>(Шематизм Львівської архієпархії 1912 р. Фонд Стрийського краєзнавчого музею). </i>
          Корпус №1 школи - деревянний будинок, збудований в <b>1928</b> році, розрахований був на 2 класні кімнати і квартиру для вчителя.
          <i>(Технічний висновок. Проектний інститут &#34;Укржитлоремпроект&#34; м. Дрогобич 1990 рік). </i>
          Отець Северин Ямінський зібрав заможниж газдів і побудував школу. Найбільший внесок y будівництво зробив Олекса Бомбик Василь, який був будівельним майстром. Косар Федір віддав частину своєї землі, дерево на школу давали інші господарі.
          <br />
          - В <b>1939-41</b> p. функціонувала 5-класова школа, y якій працювало 4 вчителів.
          <br />
          - В <b>1948-50</b> p. в початковій школі працювало 4 вчителів i навчалось 150 учнів.
          <br />
          - В <b>1950</b> p. школа зросла, було відкрито 5 - й клас .
          <br />
          - В <b>1952</b> p. школа стала семирічною, a восьмирічною  в <b>1960</b> р., у якій навчалося 175 дітей шкільного віку, працювало  15 вчителів , з яких  6 чоловік – з вищою освітою ; 2 – з незакінченою  вищою освітою і 7 вчителів – з  середньою спеціальною педагогічною освітою.
          <br />
          - В <b>1963</b> директором школи стає Гранкіна Олександра Олександрівна, вона викладала рос.мову і літературу. Завучем школи був Ільків Володимир  Йосипович.
          <br />
          - З <b>1965</b> p. завучем школи стає Пилипчій Богдан Гнатович, вчитель української мови . Гуда Василь Юрійович очолив школу в <b>1967</b> році. Пилипчій Степанія Степанівнапрацювала піонервожатою , Мелен Євгенія Михайлівна – вчитель української мови і літератури.
          <br />
          - В <b>1989</b> p. школа стала стала дев’ятирічною. На даний час в школі навчається 59 учнів , з них у 1-4 класах – 28 учнів , у 5-9 класах - 31 учень . В школі функціонує 9 класів, навчання відбувається в одну зміну . Крім того в школі працює бібліотека , книжковий фонд якої налічує 6205 примірників. Харчування дітей відбувається у шкільній їдальні.
          <br />
          - В школі працюють гуртки: вокальний, «Сходинки до інформатики» (для учнів 1-4 кл.), «Вступ до інформатики» (для учнів 5-9 кл.), екологічний, футбольний, туристичний. Заняття футбольного гуртка проходять у вівторок, середу, п’ятницю з 13:30 до 15:30 на сучасному стадіоні з штучним покриттям «Довге-арена», у школі працює швидкісний інтернет.
          
          <br /> <br /> 

          <h2 className="about__title">Досягнення</h2>
          Команда школи зайняла ІІІ місце в Стрийському районі серед основних шкіл (2011/2012 н.р.).
          Команда нашої школи представляла Стрийський район на обласних змаганнях по туризму, зайняла ІІІ місце.
          Навчально – виховний процес забезпечують 17 вчителів.
          Управління школою з <b>2011</b> н.р. здійснював: директор школи Микитчин І.М.; заступник директора з навчально – виховної роботи Слимко Н.О.
          З <b>2017</b> року директором школи призначено Ковальську Б.М.
          У <b>2022</b> році згідно рішення ХХVІІ сесії VІІІ скликання №440 від 30 серпня <b>2022</b> року Моршинської міської ради Довгівську СЗОШ І - ІІ ступенів реорганізовано в Початкову школу з дошкільним відділенням села Довге Моршинської міської ради.
          Навчально–виховний процес забезпечують 6 вчителів.
        </div>

        
      </div>
    </div>
  )
}
